app/controllers/meal_plans_controller.rb

INSERT INTO "meal_plans" ("name", "updated_at", "created_at") VALUES('value for name', '2009-06-23 06:15:04', '2009-06-23 06:15:04')
---
  def create
    @meal_plan = MealPlan.new(params[:meal_plan])

    respond_to do |format|
      if @meal_plan.save

DELETE FROM "meal_plans" WHERE "id" = 1
---
  def destroy
    @meal_plan.destroy

SELECT * FROM "meal_plans" WHERE ("meal_plans"."id" = 1)
---
  def find_meal_plan
    @meal_plan = MealPlan.find(params[:id])