app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', 'a679e635bc39f4d057fe1b047be318a066cf302c', '2009-07-09 07:58:21', '7cf25640b05c8f4c83fadc673f2fc6cbe051a9f5', NULL, NULL, 'reggie', 'registered@example.com', '2009-07-09 07:58:21')